README.md
```mermaid
erDiagram
    DIRECTOR ||--o{ PELICULA : "dirige"
    PELICULA ||--o{ FUNCION : "se proyecta en"
    SALA ||--o{ FUNCION : "alberga"
    PELICULA }|--|{ ACTOR : "actúa en"
    FUNCION ||--o{ ENTRADA : "genera"
    VENTA ||--o{ ENTRADA : "contiene"
    USUARIO ||--o{ VENTA : "realiza"
    USUARIO }|--|{ ROL : "posee"

    ACTOR {
        Long id PK
        String nombre
    }
    DIRECTOR {
        Long id PK
        String nombre
    }
    PELICULA {
        Long id PK
        String titulo
        int duracion
        int edadMinima
        Long director_id FK
    }
    SALA {
        Long id PK
        String nombre
        int capacidad
    }
    FUNCION {
        Long id PK
        LocalDateTime fechaHora
        double precio
        Long pelicula_id FK
        Long sala_id FK
    }
    ENTRADA {
        Long id PK
        String codigo
        int fila
        int asiento
        String estado
        Long funcion_id FK
        Long venta_id FK
    }
    VENTA {
        Long id PK
        LocalDateTime fecha
        double importeTotal
        String metodoPago
        String estado
        Long usuario_id FK
    }
    USUARIO {
        Long id PK
        String email
        String password
        boolean enabled
    }
    ROL {
        Long id PK
        String nombre
    }
```
